const fromNow = function (date) {
  const dur = new Date - new Date(date * 1000);
  return (
    dur < 10 * 1000 && '刚刚' ||
    dur < 60 * 1000 && '不到一分钟' ||
    dur < 30 * 60 * 1000 && '半小时前' ||
    dur < 60 * 60 * 1000 && '一小时前' ||
    dur < 12 * 60 * 60 * 1000 && '半天之内' ||
    dur < 24 * 60 * 60 * 1000 && '一天之内' ||
    dur < 3 * 12 * 60 * 60 * 1000 && '三天之内' ||
    dur < 7 * 12 * 60 * 60 * 1000 && '一周之内' ||
    dur < 30 * 12 * 60 * 60 * 1000 && '一个月之内' ||
    dur < 6 * 30 * 12 * 60 * 60 * 1000 && '半年之内' ||
    dur < 12 * 30 * 12 * 60 * 60 * 1000 && '快一年了' || '很久远了'
  )
}
export default fromNow